In [1]:
%load_ext autoreload
%autoreload 2

Import Necessary Packages

In [2]:
import os, sys
import pandas as pd
sys.path.append(os.path.abspath('../scripts'))

from data_overview import Overview

In [19]:
df = pd.read_csv('../data/colleges.csv')
df.head()

,date,state,county,city,ipeds_id,college,cases,cases_2021,notes
0,2021-05-26,Alabama,Madison,Huntsville,100654,Alabama A&M University,41,NaN,NaN
1,2021-05-26,Alabama,Montgomery,Montgomery,100724,Alabama State University,2,NaN,NaN
2,2021-05-26,Alabama,Limestone,Athens,100812,Athens State University,45,10.0,NaN
3,2021-05-26,Alabama,Lee,Auburn,100858,Auburn University,2742,567.0,NaN
4,2021-05-26,Alabama,Montgomery,Montgomery,100830,Auburn University at Montgomery,220,80.0,NaN

Performing Exploratory Data Analysis

In [5]:
df_copy = df.copy()
df_copy.head()

,date,state,county,city,ipeds_id,college,cases,cases_2021,notes
0,2021-05-26,Alabama,Madison,Huntsville,100654,Alabama A&M University,41,NaN,NaN
1,2021-05-26,Alabama,Montgomery,Montgomery,100724,Alabama State University,2,NaN,NaN
2,2021-05-26,Alabama,Limestone,Athens,100812,Athens State University,45,10.0,NaN
3,2021-05-26,Alabama,Lee,Auburn,100858,Auburn University,2742,567.0,NaN
4,2021-05-26,Alabama,Montgomery,Montgomery,100830,Auburn University at Montgomery,220,80.0,NaN

In [11]:
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1948 entries, 0 to 1947
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1948 non-null   object
 1   state       1948 non-null   object
 2   county      1946 non-null   object
 3   city        1948 non-null   object
 4   ipeds_id    1948 non-null   object
 5   college     1948 non-null   object
 6   cases       1948 non-null   int64
 7   cases_2021  1611 non-null   float64
 8   notes       36 non-null     object
dtypes: float64(1), int64(1), object(7)
memory usage: 137.1+ KB

In [7]:
overview = Overview(df_copy)
overview.missing_values_table()

Your selected dataframe has 9 columns.
There are 3 columns that have missing values.
Percentage of the total missing values in the dataset is12.83937942048825%

            Missing Values  % of Total Values    Dtype
notes                 1912               98.2   object
cases_2021             337               17.3  float64
county                   2                0.1   object

Drop the 'notes' attribute

In [20]:
df = df.drop(columns=['notes'], axis=1)
df.head()

,date,state,county,city,ipeds_id,college,cases,cases_2021
0,2021-05-26,Alabama,Madison,Huntsville,100654,Alabama A&M University,41,NaN
1,2021-05-26,Alabama,Montgomery,Montgomery,100724,Alabama State University,2,NaN
2,2021-05-26,Alabama,Limestone,Athens,100812,Athens State University,45,10.0
3,2021-05-26,Alabama,Lee,Auburn,100858,Auburn University,2742,567.0
4,2021-05-26,Alabama,Montgomery,Montgomery,100830,Auburn University at Montgomery,220,80.0

Fill missing values of "cases_2021" with 0

In [23]:
df['cases_2021'] = df['cases_2021'].fillna(0)

Fill missing county with 'none'

In [24]:
df['county'] = df['county'].fillna('None')

In [26]:
overview = Overview(df)
overview.missing_values_table()

Your selected dataframe has 8 columns.
There are 0 columns that have missing values.
Percentage of the total missing values in the dataset is0.0%

Empty DataFrame
Columns: [Missing Values, % of Total Values, Dtype]
Index: []

Export clean data to csv

In [27]:
df.to_csv('../data/clean_data.csv')

THE END OF THE DOCUMENT! YAAAAAAAY